In [1]:
import pandas as pd
import numpy as np

definir, diccionario de ejemplo

In [2]:
dict_data = {
    'edad': [10,9,13,14,12,11,12],
    'cm': [115,110,130,155,125,120,125],
    'pais':['co','mx','co','mx','mx','ch','ch'],
    'genero':['M','F','F','M','M','M','F'],
    'Q1':[5,10,8,np.nan,7,8,3],
    'Q2':[7,9,9,8,8,8,9]
}

Crear DataFrame y asignar index

In [3]:
df = pd.DataFrame(dict_data, index=['Ana','Benito', 'Camilo', 'Daniel', 'Erika', 'Fabian', 'Gabriela'])
df

          edad   cm pais genero    Q1  Q2
Ana         10  115   co      M   5.0   7
Benito       9  110   mx      F  10.0   9
Camilo      13  130   co      F   8.0   9
Daniel      14  155   mx      M   NaN   8
Erika       12  125   mx      M   7.0   8
Fabian      11  120   ch      M   8.0   8
Gabriela    12  125   ch      F   3.0   9

In [4]:
df.index

Index(['Ana', 'Benito', 'Camilo', 'Daniel', 'Erika', 'Fabian', 'Gabriela'], dtype='object')

In [5]:
df.values

array([[10, 115, 'co', 'M', 5.0, 7],
       [9, 110, 'mx', 'F', 10.0, 9],
       [13, 130, 'co', 'F', 8.0, 9],
       [14, 155, 'mx', 'M', nan, 8],
       [12, 125, 'mx', 'M', 7.0, 8],
       [11, 120, 'ch', 'M', 8.0, 8],
       [12, 125, 'ch', 'F', 3.0, 9]], dtype=object)

In [6]:
df.columns

Index(['edad', 'cm', 'pais', 'genero', 'Q1', 'Q2'], dtype='object')

In [7]:
df[['edad','Q1']]

          edad    Q1
Ana         10   5.0
Benito       9  10.0
Camilo      13   8.0
Daniel      14   NaN
Erika       12   7.0
Fabian      11   8.0
Gabriela    12   3.0

Optener columnas espcificas de un indice

In [8]:
df.loc['Erika',['edad','Q1']]

edad     12
Q1      7.0
Name: Erika, dtype: object

Optener columnas espcificas de varios indices

In [9]:
df.loc[['Ana','Erika'],['edad','Q1']]

       edad   Q1
Ana      10  5.0
Erika    12  7.0

Optener toda una columna

In [10]:
df.iloc[:,1]

Ana         115
Benito      110
Camilo      130
Daniel      155
Erika       125
Fabian      120
Gabriela    125
Name: cm, dtype: int64

Optener toda la fila

In [11]:
df.iloc[1,:]

edad         9
cm         110
pais        mx
genero       F
Q1        10.0
Q2           9
Name: Benito, dtype: object

Validar condiciones de los datos

In [12]:
df['edad'] >=12

Ana         False
Benito      False
Camilo       True
Daniel       True
Erika        True
Fabian      False
Gabriela     True
Name: edad, dtype: bool

Filtrar el DataFrame

In [13]:
df[df['edad'] >=12]

          edad   cm pais genero   Q1  Q2
Camilo      13  130   co      F  8.0   9
Daniel      14  155   mx      M  NaN   8
Erika       12  125   mx      M  7.0   8
Gabriela    12  125   ch      F  3.0   9

Multifiltro

In [14]:
df[(df['edad'] >=12)&(df['cm']>=130)]

        edad   cm pais genero   Q1  Q2
Camilo    13  130   co      F  8.0   9
Daniel    14  155   mx      M  NaN   8

Querys

In [15]:
df.query('edad >= 12')

          edad   cm pais genero   Q1  Q2
Camilo      13  130   co      F  8.0   9
Daniel      14  155   mx      M  NaN   8
Erika       12  125   mx      M  7.0   8
Gabriela    12  125   ch      F  3.0   9

Comparar entre datos de DataFrame

In [16]:
df[df['Q2']>=df['Q1']]

          edad   cm pais genero   Q1  Q2
Ana         10  115   co      M  5.0   7
Camilo      13  130   co      F  8.0   9
Erika       12  125   mx      M  7.0   8
Fabian      11  120   ch      M  8.0   8
Gabriela    12  125   ch      F  3.0   9